BellerageHackathon/src/Catalogs/ВопросыВерсийТестов/ВопросыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВопросыВерсийТестов</name>
  <owners>Catalog.ВерсииТестов</owners>
  <attributes>
    <name>ИдентификаторВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсииВопроса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстВопроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОтвета</name>
    <type>
      <types>EnumRef.ТипыОтветов</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйБалл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроверки</name>
    <type>
      <types>EnumRef.СпособыПроверкиОтвета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйОтвет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьРегистр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбрезатьПробелыПоКраям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхлопыватьПовторныеПробелы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

BellerageHackathon/src/Enums/ТипыОтветов/ТипыОтветов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОтветов</name>
  <enumValues>
    <name>ОдинПравильныйОтвет</name>
  </enumValues>
  <enumValues>
    <name>НесколькоПравильныхОтветов</name>
  </enumValues>
  <enumValues>
    <name>ПолеВвода</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СпособыПроверкиОтвета/СпособыПроверкиОтвета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПроверкиОтвета</name>
  <enumValues>
    <name>ТочныйВариант</name>
  </enumValues>
  <enumValues>
    <name>ТочныйНабор</name>
  </enumValues>
  <enumValues>
    <name>ТекстПоЭталону</name>
  </enumValues>
  <enumValues>
    <name>РучнаяПроверка</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Enums/СтатусыВерсийТестов/СтатусыВерсийТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВерсийТестов</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Опубликована</name>
  </enumValues>
  <enumValues>
    <name>ЗамененаНовой</name>
  </enumValues>
</mdclass:Enum>

BellerageHackathon/src/Catalogs/ВопросыВерсийТестов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(ИдентификаторВопроса) Тогда
		ИдентификаторВопроса = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторВерсииВопроса) Тогда
		ИдентификаторВерсииВопроса = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТипОтвета) Тогда
		ТипОтвета = Перечисления.ТипыОтветов.ОдинПравильныйОтвет;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СпособПроверки) Тогда
		СпособПроверки = Перечисления.СпособыПроверкиОтвета.ТочныйВариант;
	КонецЕсли;

	Если МаксимальныйБалл = 0 Тогда
		МаксимальныйБалл = 1;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.Наименование) Тогда
		
		ЭтотОбъект.Наименование = СтрШаблон("%1_%2_%3", ЭтотОбъект.Владелец, ЭтотОбъект.Владелец.НомерВерсии, ЭтотОбъект.ПорядокВВерсии);
		
	КонецЕсли;

	ОбрезатьПробелыПоКраям = Истина;
	СхлопыватьПовторныеПробелы = Истина;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьДоступностьИзмененияВерсии();
    Наименование = Лев(Строка(ТекстВопроса), 150);

	Если Не ЗначениеЗаполнено(ИдентификаторВопроса) Тогда
		ИдентификаторВопроса = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИдентификаторВерсииВопроса) Тогда
		ИдентификаторВерсииВопроса = Новый УникальныйИдентификатор;
	КонецЕсли;

	Если ПорядокВВерсии < 1 Тогда
		ВызватьИсключение "Порядок вопроса должен быть положительным.";
	КонецЕсли;

	Если ПустаяСтрока(СокрЛП(Строка(ТекстВопроса))) Тогда
		ВызватьИсключение "Не заполнен текст вопроса.";
	КонецЕсли;

	Если МаксимальныйБалл <= 0 Тогда
		ВызватьИсключение "Максимальный балл должен быть больше нуля.";
	КонецЕсли;

	ПроверитьУникальность();

КонецПроцедуры

Процедура ПередУдалением(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроверитьДоступностьИзмененияВерсии();

КонецПроцедуры

Процедура ПроверитьДоступностьИзмененияВерсии()
    Если Не ЭтоНовый() Тогда
        ПрежняяВерсия = Ссылка.Владелец;
        Если ЗначениеЗаполнено(ПрежняяВерсия) И ПрежняяВерсия.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик Тогда
            ВызватьИсключение "Содержимое опубликованной версии нельзя изменять или переносить.";
        КонецЕсли;
    КонецЕсли;

	Если Не ЗначениеЗаполнено(Владелец) Тогда
		ВызватьИсключение "Вопрос должен принадлежать версии теста.";
	КонецЕсли;

	Если Владелец.СтатусВерсии <> Перечисления.СтатусыВерсийТестов.Черновик Тогда
		ВызватьИсключение "Вопросы опубликованной версии нельзя изменять.";
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьУникальность()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Вопросы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВопросыВерсийТестов КАК Вопросы
	|ГДЕ
	|	Вопросы.Ссылка <> &Ссылка
	|	И (Вопросы.ИдентификаторВерсииВопроса = &ИдентификаторВерсииВопроса
	|		ИЛИ (Вопросы.Владелец = &Владелец
	|			И Вопросы.ПорядокВВерсии = &ПорядокВВерсии))";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторВерсииВопроса", ИдентификаторВерсииВопроса);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ПорядокВВерсии", ПорядокВВерсии);

	Если Не Запрос.Выполнить().Пустой() Тогда
		ВызватьИсключение "Идентификатор версии вопроса или порядок уже используется.";
	КонецЕсли;

КонецПроцедуры
